repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F1/HAL.cpp
/*
 Moses - Weakening HardwareTimer's timer bare interrupt functions
 and then replacing them here yields a performance increase.
 STM32F103RCT6 (SKR Mini E3) - Switching a pin HIGH upon entering the motion3
 timer (TIM6_IRQHandler), LOW right before exiting @ 150khz 

 Using non-weak HardwareTimer callbacks: 3.364us
 Using weakened bare timer IRQ's here:   1.362us
 (Non-weak tested by writing the pin high/low inside of HardwareTimer.cpp)
 Both timed under -O3 optimizations
 150khz~ seems to be the max stepper frequency I can achieve with non-weak timers
 without issues.
 270khz~ with bare IRQ's
*/

#if WEAK_HARDWARE_TIMERS
extern "C" void TIMER_VECTOR(MOTION2_TIMER_NUM);
extern "C" void TIMER_VECTOR(MOTION3_TIMER_NUM);
extern "C" void TIMER_VECTOR(PWM_TIMER_NUM);
extern "C" void TIMER_VECTOR(TONE_TIMER_NUM);
#else
extern void TIMER_VECTOR(MOTION2_TIMER_NUM);
extern void TIMER_VECTOR(MOTION3_TIMER_NUM);
extern void TIMER_VECTOR(PWM_TIMER_NUM);
extern void TIMER_VECTOR(TONE_TIMER_NUM);
#endif

#if NUM_SERVOS > 0 || NUM_BEEPERS > 0
extern void servoOffTimer();
#if WEAK_HARDWARE_TIMERS
extern "C" void TIMER_VECTOR(SERVO_TIMER_NUM);
#else
extern void TIMER_VECTOR(SERVO_TIMER_NUM);
#endif
static uint32_t ServoPrescalerfactor = 20000;
static uint32_t Servo2500 = 2500;
#endif

void HAL::hwSetup(void) {
#if DEBUG_TIMING
    SET_OUTPUT(DEBUG_ISR_STEPPER_PIN);
    SET_OUTPUT(DEBUG_ISR_MOTION_PIN);
    SET_OUTPUT(DEBUG_ISR_TEMP_PIN);
    SET_OUTPUT(DEBUG_ISR_ANALOG_PIN);
#endif
    // Servo control
#if NUM_SERVOS > 0 || NUM_BEEPERS > 0
    servo = reserveTimerInterrupt(SERVO_TIMER_NUM); // prevent pwm usage
    servo->timer = new HardwareTimer(TIMER(SERVO_TIMER_NUM));
    // setPWM does a resume, but we need to do some config changes before that.
    servo->timer->setMode(1, TIMER_OUTPUT_COMPARE_PWM1);
    servo->timer->setOverflow(200, HERTZ_FORMAT);
    servo->timer->attachInterrupt(TIMER_VECTOR_NAME(SERVO_TIMER_NUM));
    servo->timer->attachInterrupt(1, &servoOffTimer);

    LL_TIM_OC_EnableFast(servo->tim, servo->timer->getLLChannel(1));

    ServoPrescalerfactor = (LL_TIM_GetPrescaler(servo->tim) + 1);
    Servo2500 = ((2500 * (servo->timer->getTimerClkFreq() / 1000000)) / ServoPrescalerfactor) - 1;
    servo->timer->refresh();
    servo->timer->resume();
    HAL_NVIC_SetPriority(TIMER_IRQ(SERVO_TIMER_NUM), 2, 0);
#endif

#if NUM_BEEPERS > 0
    for (int i = 0; i < NUM_BEEPERS; i++) {
        if (beepers[i]->getOutputType() == 1) {
            LL_GPIO_SetPinSpeed(get_GPIO_Port(STM_PORT(BEEPER_PIN)), STM_LL_GPIO_PIN(BEEPER_PIN), LL_GPIO_SPEED_FREQ_LOW);
            // If we have any SW beepers, enable the beeper IRQ
            toneTimer = reserveTimerInterrupt(TONE_TIMER_NUM); // prevent pwm usage
            toneTimer->timer = new HardwareTimer(TIMER(TONE_TIMER_NUM));
            toneTimer->timer->setMode(1, TIMER_OUTPUT_COMPARE);
            toneTimer->timer->setOverflow(0, HERTZ_FORMAT);
            toneTimer->timer->attachInterrupt(TIMER_VECTOR_NAME(TONE_TIMER_NUM)); 
            toneTimer->timer->setInterruptPriority(3, 0); 
            break;
        }
    }
#endif

#if defined(TWI_CLOCK_FREQ) && TWI_CLOCK_FREQ > 0 //init i2c if we have a frequency
    HAL::i2cInit(TWI_CLOCK_FREQ);
#endif
    // make debugging startup easier
    //Serial.begin(115200);

#if EEPROM_AVAILABLE && EEPROM_MODE != EEPROM_NONE && EEPROM_AVAILABLE != EEPROM_SDCARD && EEPROM_AVAILABLE != EEPROM_FLASH
    // Copy eeprom to ram for faster access
    int i;
    for (i = 0; i < EEPROM_BYTES; i += 4) {
        eeval_t v = eprGetValue(i, 4);
        memcopy4(&virtualEeprom[i], &v.i);
    }
#else
    memset(virtualEeprom, 0, EEPROM_BYTES);
#endif
#if EEPROM_AVAILABLE == EEPROM_FLASH && EEPROM_MODE != EEPROM_NONE
    FEInit();
#endif
}

// Set up all timer interrupts
void HAL::setupTimer() {
    motion2 = reserveTimerInterrupt(MOTION2_TIMER_NUM); // prevent pwm usage
    motion2->timer = new HardwareTimer(TIMER(MOTION2_TIMER_NUM));
    motion2->timer->setMode(2, TIMER_OUTPUT_COMPARE);
    motion2->timer->setOverflow(PREPARE_FREQUENCY, HERTZ_FORMAT);
    motion2->timer->attachInterrupt(TIMER_VECTOR_NAME(MOTION2_TIMER_NUM));
    motion2->timer->resume();
    HAL_NVIC_SetPriority(TIMER_IRQ(MOTION2_TIMER_NUM), 2, 0);

    // Regular interrupts for heater control etc

    pwm = reserveTimerInterrupt(PWM_TIMER_NUM); // prevent pwm usage
    pwm->timer = new HardwareTimer(TIMER(PWM_TIMER_NUM));
    pwm->timer->setMode(2, TIMER_OUTPUT_COMPARE);
    pwm->timer->setOverflow(PWM_CLOCK_FREQ, HERTZ_FORMAT);
    pwm->timer->attachInterrupt(TIMER_VECTOR_NAME(PWM_TIMER_NUM));
    pwm->timer->resume();
    HAL_NVIC_SetPriority(TIMER_IRQ(PWM_TIMER_NUM), 2, 0);

    // Timer for stepper motor control

    motion3 = reserveTimerInterrupt(MOTION3_TIMER_NUM); // prevent pwm usage
    motion3->timer = new HardwareTimer(TIMER(MOTION3_TIMER_NUM));
    motion3->timer->setMode(2, TIMER_OUTPUT_COMPARE);
    motion3->timer->setOverflow(STEPPER_FREQUENCY, HERTZ_FORMAT);
    motion3->timer->attachInterrupt(TIMER_VECTOR_NAME(MOTION3_TIMER_NUM));
    motion3->timer->resume();
    HAL_NVIC_SetPriority(TIMER_IRQ(MOTION3_TIMER_NUM), 0, 0); // highest priority required!
}

// Try to initialize pinNumber as hardware PWM. Returns internal
// id if it succeeds or -1 if it fails. Typical reasons to fail
// are no pwm support for that pin or an other pin uses same PWM
// channel.
int HAL::initHardwarePWM(int pinNumber, uint32_t frequency) {
    if (pinNumber < 0) {
        return -1;
    }
    PinName p = digitalPinToPinName(pinNumber);
    if (p != NC) {
        const PinMap* map = PinMap_PWM;
        while (map->pin != NC) {
            if (map->pin == p) {
                break;
            }
            map++;
        }
        if (map->pin != NC) {
            TimerFunction* tf = nullptr;
            for (int i = 0; i < NUM_TIMERS; i++) {
                if (timerList[i].tim == map->peripheral) {
                    tf = &timerList[i];
                    break;
                }
            }
            if (tf == nullptr || tf->usage == TimerUsage::INTERRUPT_TIMER) {
                return -1; // already used
            }
            if (tf->usage == TimerUsage::UNUSED) {
                tf->usage = TimerUsage::PWM_TIMER;
                tf->frequency = frequency;
                tf->reserved = 1;
            } else {
                tf->reserved++;
            }
            pwmEntries[numPWMEntries].function = tf;
            pwmEntries[numPWMEntries].map = map;
            // Find timer in local usage list

            TIM_TypeDef* Instance = (TIM_TypeDef*)tf->tim;
            HardwareTimer* HT;
            uint32_t index = get_timer_index(tf->tim);
            if (HardwareTimer_Handle[index] == nullptr) {
                HardwareTimer_Handle[index]->__this = new HardwareTimer((TIM_TypeDef*)map->peripheral);
            }

            HT = (HardwareTimer*)(HardwareTimer_Handle[index]->__this);
            pwmEntries[numPWMEntries].ht = HT;
            uint32_t channel = STM_PIN_CHANNEL(map->function);
            pinMode(pinNumber, OUTPUT);
            digitalWrite(pinNumber, LOW);

