repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F1/HAL.cpp
            // preloading by default as of 1.9.0 (4.10900.200819)
            HT->setMode(channel, TIMER_OUTPUT_COMPARE_PWM1, p);
            HT->setOverflow(tf->frequency, HERTZ_FORMAT);

            LL_TIM_OC_EnableFast(tf->tim, HT->getLLChannel(channel));

            HT->refresh();
            HT->resume();
            return numPWMEntries++;
        }
    }
    return -1;
}
// Set pwm output to value. id is id from initHardwarePWM.
void HAL::setHardwarePWM(int id, int value) {
    if (id < 0 || id >= 50) { // illegal id
        return;
    }
    PWMEntry& entry = pwmEntries[id];
    entry.ht->setCaptureCompare(STM_PIN_CHANNEL(entry.map->function), value, RESOLUTION_8B_COMPARE_FORMAT);
}

void HAL::setHardwareFrequency(int id, uint32_t frequency) {
    if (id < 0 || id >= 50) { // illegal id
        return;
    }
    PWMEntry& entry = pwmEntries[id];
    entry.ht->setOverflow(frequency, HERTZ_FORMAT);
    entry.ht->refresh();
}

ADC_HandleTypeDef AdcHandle = {};
struct AnalogFunction {
    bool enabled;
    int32_t channel;
    int32_t lastValue;
    ADC_TypeDef* def;
    int32_t pin;
};

// Initialize ADC channels
static AnalogFunction analogValues[MAX_ANALOG_INPUTS] = { false, -1, 0, nullptr, -1 };
static AnalogFunction* analogMap[256] = { nullptr }; // Map pin number to entry in analogValues
int numAnalogInputs = 0;
uint32_t adcData[16] = { 0 }; // Target for DMA adc transfer

void reportAnalog() {
    for (int i = 0; i < 256; i++) {
        if (analogMap[i]) {
            Com::printF("Analog ", i);
            Com::printFLN(" = ", static_cast<int32_t>(analogMap[i]->lastValue));
        }
    }
    for (int i = 0; i < numAnalogInputs; i++) {
        Com::printF("adc ", i);
        Com::printF(" channel ", analogValues[i].channel);
        Com::printF(" pin ", analogValues[i].pin);
        Com::printFLN(", val = ", static_cast<int32_t>(adcData[i]));
    }
}

static DMA_HandleTypeDef hdma_adc;
int dmaInitState, dmaInitError;
int adcerror = 0, dmaerror = 0;

void HAL::reportHALDebug() {
    reportAnalog();
    Com::printFLN("AdcHandle state:", AdcHandle.State);
    Com::printFLN("AdcHandle ErrorCode:", AdcHandle.ErrorCode);
    Com::printFLN("hdma_adc state:", hdma_adc.State);
    Com::printFLN("hdma_adc ErrorCode:", hdma_adc.ErrorCode);
    Com::printFLN("dmaInitState state:", dmaInitState);
    Com::printFLN("dmaInitError ErrorCode:", dmaInitError);
    Com::printFLN("numAnalogInputs:", numAnalogInputs);
    Com::printFLN("numPWMEntries:", numPWMEntries);
    Com::printFLN("adcerror:", adcerror);
    Com::printFLN("dmaerror:", dmaerror);
}

//#define USE_DMA_ADC_IRQ_CALLBACK 1
// ^^^ Use the HAL_ADC_ConvCpltCallback interrupt function instead of reading the dma
// buffer inside our PWM interrupt.

// Problem with that callback is it's processing overhead.
// At the /slowest/ setting that function gets called at ~37.5khz
// Even with the simplest interrupt, just accessing it from flash
// slows us down.

void HAL::analogStart(void) {
    // Analog channels being used are already enabled. Start conversion
    // only if we have any analog sources.
    if (numAnalogInputs == 0) {
        return;
    }
    ADC_ChannelConfTypeDef sConfig = { 0 };

    // All of the following needs more tuning, but works decently for now.
    AdcHandle.Instance = ADC1;
    AdcHandle.State = 0;
    AdcHandle.Init.ScanConvMode = ADC_SCAN_ENABLE;
    AdcHandle.Init.ContinuousConvMode = ENABLE;
    AdcHandle.Init.DiscontinuousConvMode = DISABLE;
    AdcHandle.Init.NbrOfDiscConversion = 0;
    AdcHandle.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    AdcHandle.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    AdcHandle.Init.NbrOfConversion = numAnalogInputs;
    if (HAL_ADC_Init(&AdcHandle) != HAL_OK) {
        adcerror++;
        return;
    }
#ifndef USE_DMA_ADC_IRQ_CALLBACK
    sConfig.SamplingTime = ADC_SAMPLETIME_41CYCLES_5;
#else
    sConfig.SamplingTime = ADC_SAMPLETIME_239CYCLES_5;
#endif
    //ADC_SAMPLETIME_239CYCLES_5 : ADC_SAMPLETIME_71CYCLES_5; ADC_SAMPLETIME_41CYCLES_5
    for (int i = 0; i < numAnalogInputs; i++) {
        sConfig.Channel = analogValues[i].channel;
        sConfig.Rank = i + 1;
        if (HAL_ADC_ConfigChannel(&AdcHandle, &sConfig) != HAL_OK) {
            adcerror++;
            // Error_Handler();
        }
    }

    RCC_PeriphCLKInitTypeDef PeriphClkInit;
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
    PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV8;
    HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_ADC1_CLK_ENABLE();
    __HAL_RCC_DMA1_CLK_ENABLE();

    hdma_adc.Instance = DMA1_Channel1;
    hdma_adc.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_adc.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_adc.Init.MemInc = DMA_MINC_ENABLE;
    hdma_adc.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hdma_adc.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
    hdma_adc.Init.Mode = DMA_CIRCULAR;
    hdma_adc.Init.Priority = DMA_PRIORITY_HIGH;
    dmaerror += HAL_DMA_Init(&hdma_adc);

    dmaInitState = hdma_adc.State;
    dmaInitError = hdma_adc.ErrorCode;
    __HAL_LINKDMA(&AdcHandle, DMA_Handle, hdma_adc);

#ifdef USE_DMA_ADC_IRQ_CALLBACK
    HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 3, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
#endif

    // Todo: fix/check if adcdata's size is correct for word
    //                                           v          v
    dmaerror += HAL_ADC_Start_DMA(&AdcHandle, adcData, numAnalogInputs);
#ifndef USE_DMA_ADC_IRQ_CALLBACK
    __HAL_DMA_DISABLE_IT(&hdma_adc, DMA_IT_HT | DMA_IT_TE | DMA_IT_TC);
#endif
}

#ifdef USE_DMA_ADC_IRQ_CALLBACK
extern "C" void DMA1_Channel1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&hdma_adc);
}
extern "C" void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* AdcHandle) {
#ifdef DEBUG_TIMING
    WRITE(DEBUG_ISR_ANALOG_PIN, 1);
#endif
    for (int i = 0; i < numAnalogInputs; i++) {
        analogValues[i].lastValue = adcData[i];
    }
#undef IO_TARGET
#define IO_TARGET IO_TARGET_ANALOG_INPUT_LOOP
#include "io/redefine.h"
#ifdef DEBUG_TIMING
    WRITE(DEBUG_ISR_ANALOG_PIN, 0);
#endif
}
#endif

void HAL::analogEnable(int pinId) {
    PinName pin = static_cast<PinName>(pinId);
    AnalogFunction* af = &analogValues[numAnalogInputs++];
    af->def = static_cast<ADC_TypeDef*>(pinmap_peripheral(pin, PinMap_ADC));
    if (af->def == nullptr) {
        analogMap[pinId] = nullptr;
        --numAnalogInputs;
        return;
    }
    analogMap[pinId] = af;
    af->enabled = true;
    uint32_t function = pinmap_function(pin, PinMap_ADC);
    // Set pin as analog input
    GPIO_InitTypeDef GPIO_InitStruct;
    GPIO_InitStruct.Pin = STM_GPIO_PIN(pin);
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

