repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F1/HAL.cpp
    // TODO: initaliziing PA0 here completely resets port A for some reason.
    // shuts off our PWM timers etc.
    HAL_GPIO_Init(get_GPIO_Port(STM_PORT(pin)), &GPIO_InitStruct);
    af->pin = pinId;
    af->channel = STM_PIN_CHANNEL(function);
}

int HAL::analogRead(int pin) {
    AnalogFunction* af = analogMap[pin];
    if (af == nullptr) { // protect for config errors
        return 0;
    }
    return af->lastValue;
}
// Write any data type to EEPROM
void HAL::eprBurnValue(unsigned int pos, int size, union eeval_t newvalue) {
#if EEPROM_AVAILABLE == EEPROM_I2C
    i2cStartAddr(EEPROM_SERIAL_ADDR, pos, 0);
    i2cWrite(newvalue.b[0]); // write first byte
    for (int i = 1; i < size; i++) {
        pos++;
        // writes can not cross page boundary
        if ((pos % EEPROM_PAGE_SIZE) == 0) {
            // burn current page then address next one
            i2cStop();
            delayMilliseconds(EEPROM_PAGE_WRITE_TIME);
            i2cStartAddr(EEPROM_SERIAL_ADDR, pos, 0);
        }
        i2cWrite(newvalue.b[i]);
    }
    i2cStop();                                 // signal end of transaction
    delayMilliseconds(EEPROM_PAGE_WRITE_TIME); // wait for page write to complete
#elif EEPROM_AVAILABLE == EEPROM_SDCARD || EEPROM_AVAILABLE == EEPROM_FLASH
    if (pos >= EEPROM::reservedEnd) {
        eprSyncTime = 1UL; // enforce fast write to finish before power is lost
    } else {
        eprSyncTime = HAL::timeInMilliseconds() | 1UL;
    }
#endif
}

#if EEPROM_AVAILABLE == EEPROM_FLASH
millis_t eprSyncTime = 0; // in sync
void HAL::syncEEPROM() {  // store to disk if changed
    millis_t time = millis();
    if (eprSyncTime && (time - eprSyncTime > 2000)) { // Buffer writes only every 2 seconds to pool writes
        eprSyncTime = 0;
        FEUpdateChanges();
        Com::printFLN("EEPROM data updated");
    }
}
void HAL::importEEPROM() {
}
#endif
#if EEPROM_AVAILABLE == EEPROM_SDCARD

#if !SDSUPPORT
#error EEPROM using sd card requires SDCARDSUPPORT
#endif

millis_t eprSyncTime = 0; // in sync
SdFile eepromFile;
void HAL::syncEEPROM() { // store to disk if changed
    millis_t time = millis();

    if (eprSyncTime && (time - eprSyncTime > 15000)) { // Buffer writes only every 15 seconds to pool writes
        eprSyncTime = 0;
        bool failed = false;
        if (!sd.sdactive) { // not mounted
            if (eepromFile.isOpen())
                eepromFile.close();
            Com::printErrorF("Could not write eeprom to sd card - no sd card mounted");
            Com::println();
            return;
        }

        if (!eepromFile.seekSet(0))
            failed = true;

        if (!failed && eepromFile.write(virtualEeprom, EEPROM_BYTES) != EEPROM_BYTES)
            failed = true;

        if (failed) {
            Com::printErrorF("Could not write eeprom to sd card");
            Com::println();
        }
    }
}

void HAL::importEEPROM() {
    if (eepromFile.isOpen())
        eepromFile.close();
    if (!eepromFile.open("eeprom.bin", O_RDWR | O_CREAT | O_SYNC) || eepromFile.read(virtualEeprom, EEPROM_BYTES) != EEPROM_BYTES) {
        Com::printFLN(Com::tOpenFailedFile, "eeprom.bin");
    } else {
        Com::printFLN("EEPROM read from sd card.");
    }
    EEPROM::readDataFromEEPROM();
}

#endif

// Print apparent cause of start/restart
void HAL::showStartReason() {
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_LPWRRST)) {
        Com::printInfoFLN(PSTR("Low power reset"));
    } else if (__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST)) {
        Com::printInfoFLN(PSTR("Windowed watchdog reset"));
    } else if (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST)) {
        Com::printInfoFLN(Com::tWatchdog);
    } else if (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST)) {
        Com::printInfoFLN(PSTR("Software reset"));
    } else if (__HAL_RCC_GET_FLAG(RCC_FLAG_PORRST)) {
        Com::printInfoFLN(Com::tPowerUp);
    } else if (__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST)) {
        Com::printInfoFLN(PSTR("External reset pin reset"));
    } else {
        Com::printInfoFLN(PSTR("Unknown reset reason"));
    }

    // Clear all the reset flags or else they will remain set during future resets until system power is fully removed.
    __HAL_RCC_CLEAR_RESET_FLAGS();
}

// Return available memory
int HAL::getFreeRam() {
    struct mallinfo memstruct = mallinfo();
    register char* stack_ptr asm("sp");

    // avail mem in heap + (bottom of stack addr - end of heap addr)
    return (memstruct.fordblks + (int)stack_ptr - (int)sbrk(0));
}

// Reset peripherals and cpu
void HAL::resetHardware() {
    NVIC_SystemReset();
}

/****************************************************************************************
 Setting for I2C Clock speed. needed to change  clock speed for different peripherals
****************************************************************************************/

void HAL::i2cSetClockspeed(uint32_t clockSpeedHz)

{
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    WIRE_PORT.setClock(clockSpeedHz);
#endif
}

/*************************************************************************
 Initialization of the I2C bus interface. Need to be called only once
*************************************************************************/
void HAL::i2cInit(uint32_t clockSpeedHz) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    WIRE_PORT.begin(); // create I2C master access
    WIRE_PORT.setClock(clockSpeedHz);
#endif
}

/*************************************************************************
  Issues a start condition and sends address and transfer direction.
*************************************************************************/
/* void HAL::i2cStart(uint8_t address) {
    WIRE_PORT.beginTransmission(address);
} */

void HAL::i2cStartRead(uint8_t address, uint8_t bytes) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    if (!i2cError) {
        i2cError |= (WIRE_PORT.requestFrom(address, bytes) != bytes);
    }
#endif
}
/*************************************************************************
 Issues a start condition and sends address and transfer direction.
 Also specifies internal address of device

 Input:   address and transfer direction of I2C device, internal address
*************************************************************************/
void HAL::i2cStartAddr(uint8_t address, unsigned int pos, uint8_t readBytes) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    if (!i2cError) {
        WIRE_PORT.beginTransmission(address);
        WIRE_PORT.write(pos >> 8);
        WIRE_PORT.write(pos & 255);
        if (readBytes) {
            i2cError |= WIRE_PORT.endTransmission();
            i2cError |= (WIRE_PORT.requestFrom(address, readBytes) != readBytes);
        }
    }
#endif
}

/*************************************************************************
 Terminates the data transfer and releases the I2C bus
*************************************************************************/
void HAL::i2cStop(void) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    i2cError |= WIRE_PORT.endTransmission();
#endif
}

/*************************************************************************
  Send one byte to I2C device

  Input:    byte to be transfered
*************************************************************************/
void HAL::i2cWrite(uint8_t data) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    if (!i2cError) {
        WIRE_PORT.write(data);
    }
#endif
}

/*************************************************************************
 Read one byte from the I2C device, request more data from device
 Return:  byte read from I2C device
*************************************************************************/
int HAL::i2cRead(void) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    if (!i2cError && WIRE_PORT.available()) {
        return WIRE_PORT.read();
    }
#endif
    return -1; // should never happen, but better then blocking
}

#if NUM_SERVOS > 0
unsigned int HAL::servoTimings[4] = { 0, 0, 0, 0 };
static unsigned int servoAutoOff[4] = { 0, 0, 0, 0 };
static uint8_t servoId = 0;
static ServoInterface* actServo = nullptr;

