repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F1/HAL.cpp
void HAL::servoMicroseconds(uint8_t servoId, int microsec, uint16_t autoOff) {
    servoTimings[servoId] = microsec ? ((microsec * (servo->timer->getTimerClkFreq() / 1000000)) / ServoPrescalerfactor) - 1 : 0;
    servoAutoOff[servoId] = (microsec) ? (autoOff / 20) : 0;
}
#endif

// ================== Interrupt handling ======================

ServoInterface* analogServoSlots[4] = { nullptr, nullptr, nullptr, nullptr };
inline void servoOffTimer() {
#if NUM_SERVOS > 0
    if (actServo) {
        actServo->disable();
        if (servoAutoOff[servoId]) {
            servoAutoOff[servoId]--;
            if (servoAutoOff[servoId] == 0) {
                HAL::servoTimings[servoId] = 0;
            }
        }
    }
    if (++servoId >= 4) {
        servoId = 0;
    }
    actServo = analogServoSlots[servoId];
    if (actServo == nullptr) {
        servo->tim->CCR1 = Servo2500;
    } else {
        // InterruptProtectedBlock noInt;
        unsigned int ms = HAL::servoTimings[servoId];
        if (ms) {
            servo->tim->CCR1 = ms;
        } else {
            servo->tim->CCR1 = Servo2500;
        }
    }
#endif
// Add all generated servo interrupt handlers
#undef IO_TARGET
#define IO_TARGET IO_TARGET_SERVO_INTERRUPT
#include "io/redefine.h"
}

#if WEAK_HARDWARE_TIMERS
// Servo timer Interrupt handler
void TIMER_VECTOR(SERVO_TIMER_NUM) {
#if NUM_SERVOS > 0
    if (LL_TIM_IsActiveFlag_CC1(TIMER(SERVO_TIMER_NUM))) {
        LL_TIM_ClearFlag_CC1(TIMER(SERVO_TIMER_NUM));
        servoOffTimer();
    } else if (LL_TIM_IsActiveFlag_UPDATE(TIMER(SERVO_TIMER_NUM))) {
        LL_TIM_ClearFlag_UPDATE(TIMER(SERVO_TIMER_NUM));
        if (actServo) {
            actServo->enable();
        }
    }
#endif
}
#else
// Servo timer Interrupt handler
void TIMER_VECTOR(SERVO_TIMER_NUM) {
#if NUM_SERVOS > 0
    if (actServo) {
        actServo->enable();
    }
#endif
}
#endif

/** \brief Timer interrupt routine to drive the stepper motors.
*/
void TIMER_VECTOR(MOTION3_TIMER_NUM) {
#if DEBUG_TIMING
    WRITE(DEBUG_ISR_STEPPER_PIN, 1);
#endif
#if WEAK_HARDWARE_TIMERS
    LL_TIM_ClearFlag_UPDATE(TIMER(MOTION3_TIMER_NUM));
#endif
    Motion3::timer();
#if DEBUG_TIMING
    WRITE(DEBUG_ISR_STEPPER_PIN, 0);
#endif
}

ufast8_t pwmSteps[] = { 1, 2, 4, 8, 16 };
ufast8_t pwmMasks[] = { 255, 254, 252, 248, 240 };

/**
This timer is called 10000 times per second. It is used to update
pwm values for heater and some other frequent jobs.
*/

void TIMER_VECTOR(PWM_TIMER_NUM) {
#if DEBUG_TIMING
    WRITE(DEBUG_ISR_TEMP_PIN, 1);
#endif
    //InterruptProtectedBlock noInt;
#if WEAK_HARDWARE_TIMERS
    LL_TIM_ClearFlag_UPDATE(TIMER(PWM_TIMER_NUM));
#endif

    static uint8_t pwm_count0 = 0; // Used my IO_PWM_SOFTWARE!
    static uint8_t pwm_count1 = 0;
    static uint8_t pwm_count2 = 0;
    static uint8_t pwm_count3 = 0;
    static uint8_t pwm_count4 = 0;

// Add all generated pwm handlers
#undef IO_TARGET
#define IO_TARGET IO_TARGET_PWM
#include "io/redefine.h"

    counterPeriodical++;                          // Approximate a 100ms timer
    if (counterPeriodical >= PWM_COUNTER_100MS) { //  (int)(F_CPU/40960))
        counterPeriodical = 0;
        executePeriodical = 1;
    }
    pwm_count0++;
    pwm_count1 += 2;
    pwm_count2 += 4;
    pwm_count3 += 8;
    pwm_count4 += 16;

#ifndef USE_DMA_ADC_IRQ_CALLBACK
    if (__HAL_DMA_GET_FLAG(&hdma_adc, __HAL_DMA_GET_TC_FLAG_INDEX(&hdma_adc))) {
        for (int i = 0; i < numAnalogInputs; i++) {
            analogValues[i].lastValue = adcData[i];
        }
#undef IO_TARGET
#define IO_TARGET IO_TARGET_ANALOG_INPUT_LOOP
#include "io/redefine.h"
        __HAL_DMA_CLEAR_FLAG(&hdma_adc, __HAL_DMA_GET_TC_FLAG_INDEX(&hdma_adc));
    }
#endif

    GUI::handleKeypress();
#if FEATURE_WATCHDOG
    if (HAL::wdPinged) {
        IWatchdog.reload();
        HAL::wdPinged = false;
    }
#endif
#if DEBUG_TIMING
    WRITE(DEBUG_ISR_TEMP_PIN, 0);
#endif
}

// MOTION2_TIMER IRQ handler
void TIMER_VECTOR(MOTION2_TIMER_NUM) {
#if DEBUG_TIMING
    WRITE(DEBUG_ISR_MOTION_PIN, 1);
#endif
#if WEAK_HARDWARE_TIMERS
    LL_TIM_ClearFlag_UPDATE(TIMER(MOTION2_TIMER_NUM));
#endif
    Motion2::timer();
#if DEBUG_TIMING
    WRITE(DEBUG_ISR_MOTION_PIN, 0);
#endif
}

void HAL::spiInit() {
    SPI.begin();
}

void HAL::spiBegin(uint32_t clock, uint8_t mode, uint8_t msbfirst) {
    SPI.beginTransaction(SPISettings(clock, msbfirst ? MSBFIRST : LSBFIRST, mode));
}
uint8_t HAL::spiTransfer(uint8_t data) {
    return SPI.transfer(data);
}
void HAL::spiEnd() {
    SPI.endTransaction();
}

#if NUM_BEEPERS > 0
void TIMER_VECTOR(TONE_TIMER_NUM) {
#undef IO_TARGET
#define IO_TARGET IO_TARGET_BEEPER_LOOP
#include "io/redefine.h"
}
#endif

void HAL::tone(uint32_t frequency) {
#if NUM_BEEPERS > 0
#if NUM_BEEPERS > 1
    ufast8_t curPlaying = 0;
    BeeperSourceBase* playingBeepers[NUM_BEEPERS];
    // Reduce freq to nearest 100hz, otherwise we can get some insane freq multiples (from eg primes).
    // also clamp max freq.
    constexpr ufast8_t reduce = 100;
    constexpr uint32_t maxFreq = 100000;
    uint32_t multiFreq = frequency - (frequency % reduce);
    for (size_t i = 0; i < (NUM_BEEPERS + curPlaying); i++) {
        uint16_t beeperCurFreq = 0;
        if (i >= NUM_BEEPERS) {
            if (multiFreq > maxFreq) {
                multiFreq = maxFreq;
            }
            beeperCurFreq = playingBeepers[i - NUM_BEEPERS]->getCurFreq();
            beeperCurFreq -= (beeperCurFreq % reduce);
            playingBeepers[i - NUM_BEEPERS]->setFreqDiv((multiFreq / beeperCurFreq) - 1);
        } else {
            if (beepers[i]->getOutputType() == 1 && beepers[i]->isPlaying()) {
                beeperCurFreq = beepers[i]->getCurFreq();
                beeperCurFreq -= (beeperCurFreq % reduce);
                if (!multiFreq) {
                    multiFreq = beeperCurFreq;
                }
                multiFreq = RMath::LCM(multiFreq, beeperCurFreq);
                playingBeepers[curPlaying++] = beepers[i];
            }
        }
    }
    frequency = multiFreq;
#endif
    if (frequency < 1) {
        return;
    }
    toneTimer->timer->pause();
    toneTimer->timer->setOverflow(2 * frequency, HERTZ_FORMAT);
    toneTimer->timer->resume();
#endif
}
void HAL::noTone() {
#if NUM_BEEPERS > 0
#if NUM_BEEPERS > 1
    // If any IO beeper is still playing, we can't stop the timer yet.
    for (size_t i = 0; i < NUM_BEEPERS; i++) {
        if (beepers[i]->getOutputType() == 1 && beepers[i]->isPlaying()) {
            HAL::tone(0);
            return;
        }
    }
#endif
    if (toneTimer != nullptr) { // could be called before timer are initialized!
        toneTimer->timer->pauseChannel(1);
    }
#endif
}

typedef void (*pFunction)(void);
void init(void) {
    hw_config_init();
}

void HAL::switchToBootMode() {
    // Todo: can use this to immediately load a new firmware version
    // using BTT's bootloader.
}

#endif
